app/views/photos/index.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 9]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
			<br>
			<%  photo.comments.each do |comment|  %>
				<p><%= comment.comment%></p>
				<% name = comment.user.first_name + " " + comment.user.last_name %>