app/views/photos/newTag.html.erb

SELECT "users".* FROM "users"
---
	<%= hidden_field_tag :deltaY %>
	<%= select_tag "userId", options_from_collection_for_select(User.all, "id", "first_name"), prompt: "Who are you tagging?" %>