app/controllers/comments_controller.rb

  def new
  	if Photo.exists?(params[:id])
	  	@id = params[:id]
	  	@thisPhoto = Photo.find(@id)
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]

  def create
  	if !session[:user]
  		flash[:error] = "Nobody logged in"
  	else
	  	comment = Comment.new
	  	comment.photo = Photo.find(params[:id])
	  	comment.user = session[:user]
	  	comment.date_time = Time.now
	  	comment.comment = params[:comment]
	  	comment.save()
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "bruh"], ["created_at", "2015-02-12 06:14:53.179370"], ["date_time", "2015-02-12 06:14:53.178842"], ["photo_id", 2], ["updated_at", "2015-02-12 06:14:53.179370"], ["user_id", 1]]