app/controllers/photos_controller.rb

  def index
  	@id = params[:id]
  	@name = User.find(@id).first_name + " " + User.find(@id).last_name
 	@allPics = User.find(@id).photos
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "photos".* FROM "photos"  WHERE "photos"."user_id" = ?  [["user_id", 3]]

  def newTag
    @photo = Photo.find(params[:id])
    @id = @photo.user.id
    @users = User.all
    thisTag = Tag.new
    thisTag.x1 = params[:xcord]
    thisTag.y1 = params[:ycord]
    thisTag.deltax = params[:deltaX]
    thisTag.deltax = params[:deltaY]
    thisTag.photo_id = params[:userId]
    thisTag.save()
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 10]]
SELECT "users".* FROM "users"
INSERT INTO "tags" ("created_at", "deltax", "photo_id", "updated_at", "x1", "y1") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-11 21:48:01.791941"], ["deltax", 91], ["photo_id", 3], ["updated_at", "2015-03-11 21:48:01.791941"], ["x1", 108], ["y1", 146]]

  def create
  	uploaded_io = params[:photo][:photo]
  	File.open(Rails.root.join('app', 'assets', 'images', uploaded_io.original_filename), 'wb') do |file|
    	file.write(uploaded_io.read)
  	end
  	if !session[:user]
  		flash[:error] = "Nobody logged in"
  	else
	  	thisPic = Photo.new
	  	thisPic.file_name = uploaded_io.original_filename
	  	thisPic.created_at = DateTime.now
---
INSERT INTO "photos" ("created_at", "file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-12 23:30:01.529558"], ["file_name", "noun_220_cc.png"], ["updated_at", "2015-02-12 23:30:01.530356"], ["user_id", 1]]