app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."login" = 'cyrus' LIMIT 1
---
	def post_login
		@loggedOn = User.find_by_login(params[:login]);

SELECT  "users".* FROM "users"  WHERE "users"."login" = 'login' LIMIT 1
INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-02-13 08:01:29.728750"], ["first_name", "first"], ["last_name", "last"], ["login", "pass"], ["salt", 550510312219], ["updated_at", "2015-02-13 08:01:29.728750"]]
---
	def create
		if params[:password1] == params[:password2] and User.find_by_login(:login) == nil
			newUser = User.new
			newUser.first_name = params[:first]
			newUser.last_name = params[:last]
			newUser.login = params[:login]
			newUser.password = params[:password1]
			if newUser.save()